Revit 2024 API
FabricationPartSizeMap.Depth Property
 The depth of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public double Depth { get; set; }
Visual Basic
Public Property Depth As Double
	Get
	Set
Visual C++
public:
property double Depth {
	double get ();
	void set (double value);
}
See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace